#include <iostream>
#include <iomanip>
#include <string>
#include <windows.h>


using namespace std;
int main() {
    SetConsoleCP(CP_UTF8);
    SetConsoleOutputCP(CP_UTF8);
     int year1, year2, year3;
     string name1, name2, name3;
     int diam1, diam2, diam3;
     int freq1, freq2, freq3;
     cout << "1. Введіть: рік, керівника, діаметр антени, робочу частоту > ";
     cin >> year1 >> name1 >> diam1 >> freq1;
     cout << "2. Введіть: рік, керівника, діаметр антени, робочу частоту > ";
     cin >> year2 >> name2 >> diam2 >> freq2;
     cout << "3. Введіть: рік, керівника, діаметр антени, робочу частоту > ";
     cin >> year3 >> name3 >> diam3 >> freq3;

     cout << "----------------------------------------------------------------------------\n";
     cout << "| Проекти пошуку позаземних сигналів                                       |\n";
     cout << "|--------------------------------------------------------------------------|\n";
     cout << "| Рік  | Науковий керівник | Діаметр антени (м) | Робоча частота (МГц)     |\n";
     cout << "|------|--------------------|--------------------|-------------------------|\n";

     cout << "|" << setw(6) << year1 << "|" << setw(20) << name1
         << "|" << setw(20) << diam1 << "|" << setw(26) << freq1 << "  |" << endl;

     cout << "|" << setw(6) << year2 << "|" << setw(20) << name2
         << "|" << setw(20) << diam2 << "|" << setw(26) << freq2 << "  |" << endl;

     cout << "|" << setw(6) << year3 << "|" << setw(20) << name3
         << "|" << setw(20) << diam3 << "|" << setw(26) << freq3 << "  |" << endl;

     cout << "|--------------------------------------------------------------------------|\n";
     cout << "| Примітка: спостерігалися об'єкти від 2 зірок до кількох галактик         |\n";
     cout << "----------------------------------------------------------------------------\n";

    return 0;
}